CSI API ETABS v1
cDetailing.GetDetailedColumnStackData_2 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedColumnStackData_2(
	string ColumnStackID,
	ref string[] ObjectUniqueNames,
	ref int NumLongBarSets,
	ref int[] NumLongBars,
	ref int[] NumLongR2Bars,
	ref int[] NumLongR3Bars,
	ref string[] LongBarGUID,
	ref double[] LongBarDiameter,
	ref string[] LongBarNotation,
	ref double[] LongBarStartDist,
	ref int[] LongBarStartBend,
	ref int[] LongBarEndBend,
	ref double[] LongBarLength,
	ref int[] LongBarNumLayers,
	ref int NumTieZones,
	ref string[] TieBarZone,
	ref int[] NumTieBars,
	ref int[] NumTieR2Legs,
	ref int[] NumTieR3Legs,
	ref string[] TieBarGUID,
	ref double[] TieBarDiameter,
	ref string[] TieBarNotation,
	ref double[] TieBarStartDist,
	ref double[] TieBarSpacing,
	ref int[] TieBarType
)
Function GetDetailedColumnStackData_2 (
	ColumnStackID As String,
	ByRef ObjectUniqueNames As String(),
	ByRef NumLongBarSets As Integer,
	ByRef NumLongBars As Integer(),
	ByRef NumLongR2Bars As Integer(),
	ByRef NumLongR3Bars As Integer(),
	ByRef LongBarGUID As String(),
	ByRef LongBarDiameter As Double(),
	ByRef LongBarNotation As String(),
	ByRef LongBarStartDist As Double(),
	ByRef LongBarStartBend As Integer(),
	ByRef LongBarEndBend As Integer(),
	ByRef LongBarLength As Double(),
	ByRef LongBarNumLayers As Integer(),
	ByRef NumTieZones As Integer,
	ByRef TieBarZone As String(),
	ByRef NumTieBars As Integer(),
	ByRef NumTieR2Legs As Integer(),
	ByRef NumTieR3Legs As Integer(),
	ByRef TieBarGUID As String(),
	ByRef TieBarDiameter As Double(),
	ByRef TieBarNotation As String(),
	ByRef TieBarStartDist As Double(),
	ByRef TieBarSpacing As Double(),
	ByRef TieBarType As Integer()
) As Integer
Dim instance As cDetailing
Dim ColumnStackID As String
Dim ObjectUniqueNames As String()
Dim NumLongBarSets As Integer
Dim NumLongBars As Integer()
Dim NumLongR2Bars As Integer()
Dim NumLongR3Bars As Integer()
Dim LongBarGUID As String()
Dim LongBarDiameter As Double()
Dim LongBarNotation As String()
Dim LongBarStartDist As Double()
Dim LongBarStartBend As Integer()
Dim LongBarEndBend As Integer()
Dim LongBarLength As Double()
Dim LongBarNumLayers As Integer()
Dim NumTieZones As Integer
Dim TieBarZone As String()
Dim NumTieBars As Integer()
Dim NumTieR2Legs As Integer()
Dim NumTieR3Legs As Integer()
Dim TieBarGUID As String()
Dim TieBarDiameter As Double()
Dim TieBarNotation As String()
Dim TieBarStartDist As Double()
Dim TieBarSpacing As Double()
Dim TieBarType As Integer()
Dim returnValue As Integer
returnValue = instance.GetDetailedColumnStackData_2(ColumnStackID,
	ObjectUniqueNames, NumLongBarSets,
	NumLongBars, NumLongR2Bars, NumLongR3Bars,
	LongBarGUID, LongBarDiameter, LongBarNotation,
	LongBarStartDist, LongBarStartBend,
	LongBarEndBend, LongBarLength, LongBarNumLayers,
	NumTieZones, TieBarZone, NumTieBars,
	NumTieR2Legs, NumTieR3Legs, TieBarGUID,
	TieBarDiameter, TieBarNotation,
	TieBarStartDist, TieBarSpacing,
	TieBarType)
int GetDetailedColumnStackData_2(
	String^ ColumnStackID,
	array<String^>^% ObjectUniqueNames,
	int% NumLongBarSets,
	array<int>^% NumLongBars,
	array<int>^% NumLongR2Bars,
	array<int>^% NumLongR3Bars,
	array<String^>^% LongBarGUID,
	array<double>^% LongBarDiameter,
	array<String^>^% LongBarNotation,
	array<double>^% LongBarStartDist,
	array<int>^% LongBarStartBend,
	array<int>^% LongBarEndBend,
	array<double>^% LongBarLength,
	array<int>^% LongBarNumLayers,
	int% NumTieZones,
	array<String^>^% TieBarZone,
	array<int>^% NumTieBars,
	array<int>^% NumTieR2Legs,
	array<int>^% NumTieR3Legs,
	array<String^>^% TieBarGUID,
	array<double>^% TieBarDiameter,
	array<String^>^% TieBarNotation,
	array<double>^% TieBarStartDist,
	array<double>^% TieBarSpacing,
	array<int>^% TieBarType
)
abstract GetDetailedColumnStackData_2 :
        ColumnStackID : string *
        ObjectUniqueNames : string[] byref *
        NumLongBarSets : int byref *
        NumLongBars : int[] byref *
        NumLongR2Bars : int[] byref *
        NumLongR3Bars : int[] byref *
        LongBarGUID : string[] byref *
        LongBarDiameter : float[] byref *
        LongBarNotation : string[] byref *
        LongBarStartDist : float[] byref *
        LongBarStartBend : int[] byref *
        LongBarEndBend : int[] byref *
        LongBarLength : float[] byref *
        LongBarNumLayers : int[] byref *
        NumTieZones : int byref *
        TieBarZone : string[] byref *
        NumTieBars : int[] byref *
        NumTieR2Legs : int[] byref *
        NumTieR3Legs : int[] byref *
        TieBarGUID : string[] byref *
        TieBarDiameter : float[] byref *
        TieBarNotation : string[] byref *
        TieBarStartDist : float[] byref *
        TieBarSpacing : float[] byref *
        TieBarType : int[] byref -> int
Parameters
ColumnStackID
Type: System.String
ObjectUniqueNames
Type: System.String[]
NumLongBarSets
Type: System.Int32
NumLongBars
Type: System.Int32[]
NumLongR2Bars
Type: System.Int32[]
NumLongR3Bars
Type: System.Int32[]
LongBarGUID
Type: System.String[]
LongBarDiameter
Type: System.Double[]
LongBarNotation
Type: System.String[]
LongBarStartDist
Type: System.Double[]
LongBarStartBend
Type: System.Int32[]
LongBarEndBend
Type: System.Int32[]
LongBarLength
Type: System.Double[]
LongBarNumLayers
Type: System.Int32[]
NumTieZones
Type: System.Int32
TieBarZone
Type: System.String[]
NumTieBars
Type: System.Int32[]
NumTieR2Legs
Type: System.Int32[]
NumTieR3Legs
Type: System.Int32[]
TieBarGUID
Type: System.String[]
TieBarDiameter
Type: System.Double[]
TieBarNotation
Type: System.String[]
TieBarStartDist
Type: System.Double[]
TieBarSpacing
Type: System.Double[]
TieBarType
Type: System.Int32[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace